import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        
        // A: 1 3 5 7 9
        //  a > 5 
        // C: 3 - 5 a = 4, mvcc
        // 
        // D: insert a = 4
    }

    // 需要准备一份自我介绍，背下来了，现在的自我介绍卡壳太多，没什么价值
    // 简历很多破绽，
    // 分库分表解决什么问题
    // 你的分布式ID用在哪里，为什么要用分布式ID？为什么不用自增ID？
    // 间隙锁，解决什么问题？没有间隙锁会怎么样？
    // 间隙锁怎么加的？A加了间隙锁，B来了，那么会怎么样？
    // 机器到redis的网络挂了怎么办
    // 什么时候分库，什么时候分表
    // 根据什么情况分库分表，什么是分库，什么是分表
    // 分库能解决什么问题，分表呢？
    // map优化双重for循环，你是根据什么来判断是否需要优化的？还是用到双重for的地方都一股脑的改成Map？
    // 单链表的排序：我new了新链表写了插入排序，但是实际应该是快慢指针，fast走俩步，slow走一步，然后找到了链表的中点，开始归并排序
    // 分片键如何选择？
    // 什么情况下不适合分库分表？

}
